Revit 2024 API
IDirectContext3DServer.GetSourceId Method
 Reports this server's source ID.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
string GetSourceId()
Visual Basic
Function GetSourceId As String
Visual C++
String^ GetSourceId()
Return Value
 The source ID.
See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace